import { combineReducers } from "redux";
const initialData = {
    title1:"Hyundai Motor Group သည် US တွင် EV နှင့် ဘက်ထရီ အဆောက်အဦများ တည်ဆောက်ရန် ဒေါ်လာ 5.5 ဘီလီယံ ရင်းနှီးမြှပ်နှံမည်",
    para1:"ဝါရှင်တန်/ဆိုးလ် (Reuters) - တောင်ကိုရီးယား Hyundai Motor Group သည် အမေရိကန်တွင် ၎င်း၏ ပထမဆုံး အထူးသီးသန့် လျှပ်စစ်ကား (EV) နှင့် ဘက်ထရီ ထုတ်လုပ်ရေး စက်ရုံများ တည်ဆောက်ရန်အတွက် ဒေါ်လာ ၅.၅၄ ဘီလီယံခန့် ရင်းနှီးမြှုပ်နှံရန် စီစဉ်ထားကြောင်း သောကြာနေ့တွင် ပြောကြားခဲ့သည်။Hyundai သည် ဂျော်ဂျီယာရှိ ၎င်း၏စက်ရုံသစ်ကို 2023 ခုနှစ်အစောပိုင်းတွင် စတင်ခြေချမည်ဖြစ်ပြီး 2025 ခုနှစ် ပထမနှစ်ဝက်တွင် EV အစီးရေ 300,000 ဖြင့် စီးပွားဖြစ်ထုတ်လုပ်နိုင်မည်ဟု မျှော်လင့်ထားကြောင်း ကုမ္ပဏီ၏ထုတ်ပြန်ချက်တွင် ဖော်ပြထားသည်။တောင်ကိုရီးယား မော်တော်ယာဉ်လုပ်ငန်းစုက အလုပ်အကိုင်ပေါင်း ၈၁၀၀ ခန့် ဖန်တီးရန် ရည်ရွယ်ထားကြောင်း သိရသည်။Hyundai Motor Co နှင့် Kia Corp တို့ပိုင်ဆိုင်သည့် Hyundai Motor Group မှ ဘက်ထရီထုတ်လုပ်သည့် စက်ရုံအား မဟာဗျူဟာမြောက် ပူးပေါင်းဆောင်ရွက်မှုဖြင့် တည်ဆောက်သွားမည်ဖြစ်ပြီး အသေးစိတ်အချက်အလက်များကို နောက်ပိုင်းအဆင့်တွင် ထုတ်ဖော်သွားမည်ဖြစ်ကြောင်း ပြောကြားခဲ့သည်။ဟွန်ဒိုင်းသည် အမေရိကန်တွင် EV ထုတ်လုပ်မှု စက်ရုံတည်ဆောက်ရန် ဆွေးနွေးနေပြီး ဂျော်ဂျီယာအရာရှိများနှင့် ဆွေးနွေးမှုများ ပြုလုပ်ခဲ့ကြောင်း ပြီးခဲ့သည့် သီတင်းပတ်က Reuters သတင်းတွင် ဖော်ပြထားသည်။အဆိုပါစက်ရုံသည် 2025 ခုနှစ်အထိ အမေရိကန်နိုင်ငံတွင် Hyundai ၏ $7.4 ဘီလီယံ ရင်းနှီးမြုပ်နှံရန် စီစဉ်ထားသော အဓိကအစိတ်အပိုင်းတစ်ခုဖြစ်ပြီး အနာဂတ်တွင် ရွေ့လျားသွားလာနိုင်စေရန်အတွက် ဖြစ်သည်။ ဂျော်ဂျီယာပြည်နယ်သည် ရင်းနှီးမြုပ်နှံမှု၏ထိပ်တွင် တွဲဖက်မဟုတ်သော Hyundai Motor Group ပေးသွင်းသူများထံမှ နောက်ထပ် ရင်းနှီးမြှုပ်နှံမှု ဒေါ်လာ ၁ ဘီလီယံ ထပ်မံဆွဲဆောင်ရန် မျှော်လင့်ထားသည်။",
    title2:"Biden ခရီးစဉ်အတွင်း အမေရိကန်သည် တောင်ကိုရီးယား EV ကုမ္ပဏီများထံ ကြိုးသွယ်ရန် ကြိုးစားနေသည်။",
    para2:"တရုတ်နိုင်ငံကို အဓိကနည်းပညာထောက်ပံ့ရေးကွင်းဆက်များဖြစ်သည့် ဆီမီးကွန်ဒတ်တာများနှင့် လျှပ်စစ်ကား (EV) ဘက်ထရီများထံ ခွဲထုတ်ရန် ရည်ရွယ်ထားသည့် ၎င်း၏ Indo-Pacific Economic Framework ကို အမေရိကန်က စတင်လုပ်ဆောင်ရန် မျှော်လင့်ထားသော်လည်း အဆိုပါ လုပ်ဆောင်ချက်သည် တရုတ်နိုင်ငံ၏ အရေးပါသော အခန်းကဏ္ဍကို လှုပ်ခတ်သွားစေမည်မဟုတ်ကြောင်း တရုတ်လေ့လာသုံးသပ်သူများက ပြောကြားခဲ့သည်။ ကမ္ဘာ့ထောက်ပံ့ရေးကွင်းဆက်တွင်။သဘောတရားရေးရာအရ လှုံ့ဆော်သည့် အဆိုပါ သဘောတူညီချက်သည် ကမ္ဘာလုံးဆိုင်ရာ စီးပွားရေး ခွဲဝေမှု၏ ကျိုးကြောင်းဆီလျော်မှုနှင့် မညီဘဲ အခြားနိုင်ငံများနှင့် ဆက်ဆံရာတွင် အမေရိကန်၏ အနိုင်ကျင့်သည့် အပြုအမူကြောင့် ဝါရှင်တန်က မျှော်လင့်ထားသည့်အတိုင်း ခိုင်မာသော ရလဒ်များ ထွက်ပေါ်လာနိုင်ဖွယ် မရှိကြောင်း ကျွမ်းကျင်သူများက ပြောကြားခဲ့သည်။"
}
const siteDataReducer = (state = initialData,{type, payload})=>{
    switch(type){
        case 'add':
            return state = payload;
        case 'remove':
            return state = {};
        default :
            return state;
    }
}

const reducers = combineReducers({
    siteData:siteDataReducer
});

export default reducers;